memo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-18 Sun 00:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Meetup-online</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jin SANO" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Meetup-online</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge0d5b07">1. 不明な点・若干怪しい箇所がある場合</a></li>
<li><a href="#org0b837ea">2. コメント</a>
<ul>
<li><a href="#orga4cd6be">2.1. モジュールの説明のコメント</a></li>
</ul>
</li>
<li><a href="#orgf6b4c4f">3. ライブラリのインポートなど</a></li>
<li><a href="#orgf54010a">4. ディレクトリ構成</a></li>
<li><a href="#org1b3f101">5. 状態の更新を行う関数について</a>
<ul>
<li><a href="#org37e720a">5.1. サブモジュールで定義され，親モジュールで使われる状態の更新を行う関数</a></li>
<li><a href="#org1ed9deb">5.2. 親モジュールで定義され，サブモジュールで使われる状態の更新を伴う関数</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
雑なコーディング規約
</p>
<ul class="org-ul">
<li>これはこうすることを強制するとか言うことでは全然なくて，
「ぼくはできるだけこうするつもりなので，そう思って読むと読みやすいかも」
と言うだけ</li>
<li>従う必要はないし，むしろもっと良いやり方があるなら是非そうするべき</li>
<li>僕がこれに従っていない場合は，おそらく直し忘れなので，できれば直しておいてください</li>
</ul>


<div id="outline-container-orge0d5b07" class="outline-2">
<h2 id="orge0d5b07"><span class="section-number-2">1</span> 不明な点・若干怪しい箇所がある場合</h2>
<div class="outline-text-2" id="text-1">
<p>
??? と書いておいてもらえると，そこを重点的にリファクタします（たぶん）
</p>
<ul class="org-ul">
<li>気軽に書いておいてくれるとむしろ助かる</li>
<li>怪しい箇所は減らしたいので</li>
</ul>
</div>
</div>



<div id="outline-container-org0b837ea" class="outline-2">
<h2 id="org0b837ea"><span class="section-number-2">2</span> コメント</h2>
<div class="outline-text-2" id="text-2">
<p>
over commenting で全然構わないので，とにかくコメントを書く
</p>
<ul class="org-ul">
<li>関数名と同じコメントとかでも全然オッケー</li>
<li>なんか書いておいた方が後でちょい付け足そうと言う気分になりやすいので</li>
</ul>


<p>
逆に，少しでも冗長だと思ったものは削除して構わない
</p>
<ul class="org-ul">
<li>ぼくよりもむしろはたくんのためのものなので</li>
</ul>
</div>


<div id="outline-container-orga4cd6be" class="outline-3">
<h3 id="orga4cd6be"><span class="section-number-3">2.1</span> モジュールの説明のコメント</h3>
<div class="outline-text-3" id="text-2-1">
<p>
ソースファイルはその冒頭にモジュールの説明を以下のようにつける
</p>

<div class="org-src-container">
<pre class="src src-typescript">////////////////////////////////////////////////////////////////////////////////
//
// モジュールの説明
//
////////////////////////////////////////////////////////////////////////////////
</pre>
</div>

<p>
（上下の <code>//</code> の数は，80 にしているつもり）
</p>
</div>
</div>
</div>


<div id="outline-container-orgf6b4c4f" class="outline-2">
<h2 id="orgf6b4c4f"><span class="section-number-2">3</span> ライブラリのインポートなど</h2>
<div class="outline-text-2" id="text-3">
<p>
使っていないライブラリをインポートしている可能性とかも
</p>
<ul class="org-ul">
<li>Emacs （のぼくの現状の環境設定）だと，linter みたいなのは全く使えないので，100% 見落としているだけです</li>
<li>削除してください</li>
</ul>
</div>
</div>



<div id="outline-container-orgf54010a" class="outline-2">
<h2 id="orgf54010a"><span class="section-number-2">4</span> ディレクトリ構成</h2>
<div class="outline-text-2" id="text-4">
<p>
（特に）サブコンポーネントを持つモジュールは，
モジュール名のディレクトリを作ってその中に入れる
</p>
<ul class="org-ul">
<li>つまり，あるディレクトリないでのエントリーポイントはそのディレクトリと同じ名前のファイルの中の同じ名前のモジュール</li>
</ul>


<p>
ディレクトリには README.md を入れておく
</p>
<ul class="org-ul">
<li>ソースコードへのリンクと簡単な説明を書いておく</li>
</ul>
</div>
</div>



<div id="outline-container-org1b3f101" class="outline-2">
<h2 id="org1b3f101"><span class="section-number-2">5</span> 状態の更新を行う関数について</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org37e720a" class="outline-3">
<h3 id="org37e720a"><span class="section-number-3">5.1</span> サブモジュールで定義され，親モジュールで使われる状態の更新を行う関数</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Redux などの導入を後でしやすくするために，
サブモジュールで定義され，親モジュールで使われる，状態変化（副作用）を起こす関数は，
`updateWith` + &lt;呼び出す状況&gt; のように命名することにする
</p>

<p>
これらの関数は
</p>
<ol class="org-ol">
<li>ゼロ個以上の引数と，一つ前の状態を渡し</li>
<li><p>
次の状態を返す（この戻り値を使って，状態の更新を行う）
</p>

<div class="org-src-container">
<pre class="src src-typescript">// 自分が部屋に入ったとサーバから返事が返ってきた場合
// 自分の userId と先に部屋にいた人たちの情報をサーバに返してもらう
socket.on('joined', (myUserId: UserId, jsonStrOtherUsers: string) =&gt; {
    this.setState(state =&gt; updateWithJoined(myUserId, jsonStrOtherUsers)(state);
});
</pre>
</div></li>
</ol>
</div>
</div>


<div id="outline-container-org1ed9deb" class="outline-3">
<h3 id="org1ed9deb"><span class="section-number-3">5.2</span> 親モジュールで定義され，サブモジュールで使われる状態の更新を伴う関数</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Redux を後で導入しやすくするために，
親モジュールで定義され，サブモジュールで使われる，状態変化（副作用）を起こす関数は，
`dispatch` + &lt;動作&gt; のように命名することにする
</p>

<p>
内部でさらに他の状態変化を起こす関数を呼び出す際は，
</p>
<ol class="org-ol">
<li>それらを全て先に呼び出してから，</li>
<li>（必要なら）状態の更新を行う</li>
</ol>
<p>
ように実装する
</p>


<div class="org-src-container">
<pre class="src src-typescript">// チャットメッセージの送信による状態変化
const dispatchSendChatMessage = (chatMessage: ChatMessage) =&gt; {
    this.dispatchSendMessageTo(undefined)({ type: 'chat', chatMessage }); // チャットをブロードキャスト送信
    this.setState(state =&gt; ({
	...state, chats: [...state.chats, chatMessage] // 自分のチャットメッセージ一覧にも追加しておく
    }));
};
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jin SANO</p>
<p class="date">Created: 2021-07-18 Sun 00:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
